---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OriginatingElementName
source: html/7516fc1c-0f8d-f6ef-bc00-23a8a5d22441.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OriginatingElementName Property

"Originating Element"

## Syntax (C#)
```csharp
public static ForgeTypeId OriginatingElementName { get; }
```